Assignment Pandas Basic

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

a=pd.Series([4,8,15,16,23,42])
print(a)
print(type(a))

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
var =[1,2,3,4,4,5,6,7,8,9]
ser=pd.Series(var)
print(ser)

0    1
1    2
2    3
3    4
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [6]:

dt={"Name":['Alice','Bob','Claire'], "Age":[25,30,28],"Gender":["Female","Male","Female"]}

var=pd.DataFrame(dt)

print(var)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   28  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Ans: Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. 
DataFrame is different from series is  that a DataFrame can have multiple columns, while a Series can only have one. This means that a DataFrame can store more complex and heterogeneous data, while a Series can store more simple and homogeneous data
Example :-

In [16]:

import pandas as pd
data= [[1,2,3,4,5],[11,12,13,14,15],[11,22,33,44,55]]
ser=pd.Series(data)
df=pd.DataFrame(data)
print(ser)
print(df)

0         [1, 2, 3, 4, 5]
1    [11, 12, 13, 14, 15]
2    [11, 22, 33, 44, 55]
dtype: object
    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15
2  11  22  33  44  55

we can see, the Series is a one-dimensional object with a single column, while the DataFrame is a two-dimensional object with multiple columns. The Series can only contain a single data type, while the DataFrame can contain multiple data types.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Ans : In Pandas Series, DataFrame and pannel are all mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [2]:
import pandas as pd
sr ={"x": pd.Series([1,2,3,4,5]), "y": pd.Series([11,12,13,14,15]),"z":pd.Series([22,33,44,55,66])}
Multi=pd.DataFrame(sr)
print(Multi)

   x   y   z
0  1  11  22
1  2  12  33
2  3  13  44
3  4  14  55
4  5  15  66

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
Ans : loc(), iloc(), head(), tail() and adding columns or  dropping columns in  dataframe using insert() and drop() funtions there are some common functions we can use manipulate data in pandas.
Example:

In [13]:
data1={'Name' : ["John", "Alex","Aman","josh"],
        'City' : ["xyz", "abc","pqr","def"]}

In [14]:
df=pd.DataFrame(data1)

In [16]:
df["new_col"]=['ghvc','jgj','kjg','pol']

In [17]:
df

   Name City new_col
0  John  xyz    ghvc
1  Alex  abc     jgj
2  Aman  pqr     kjg
3  josh  def     pol

In [20]:
df.drop("new_col", axis=1)

   Name City
0  John  xyz
1  Alex  abc
2  Aman  pqr
3  josh  def